08) int i=20, j; j=((i++)+(10*5)) >>(2%6); j的值是多少? /*
((i++)+(10*5)) = 20 + 50 = 70; 2%6 = 2;
70 >> 2 代表向右移2的二次方 70/4 = 17 (int去掉後面小數點) 
*///答案: 17

11) int x=5; int a,b,c,d; a=x; b=x++; c=++x; d=--x; 這些整數變數最終的值為何? /*
a=x; //a=5, x=5
b=x++; //b=5, 分號後x=6
c=++x; //c=7, x=7
d=--x; //d=6, x=6
*/

12) byte i=4; byte j; j=i>>1; 此程式碼發生 例外錯誤/編譯錯誤/執行錯誤/沒有錯誤 /*
java在處理比int小的型別(byte、short、char等)，會因為運算效率或避免遺失精度，所以幫忙提升成int型別~
應修改為: byte j=(byte)(i>>1);
*///答案: 編譯錯誤 Compile Error (java:啾咪不用謝)

17)

19) int i=4, j=8, k=2, m; m=(i<<k)+k; 請問m值為何? (原題目是 m=(i<>k)，有做修正) /*
4<<2 代表4向左移，4*(2^2)=16;
16+2=18 
*///答案: 18

20) int i=25; 請問 i%=2+1;的值為何? /* 
由於 + 的優先權高於 %= (複合賦值運算子QAQ)，因此實際上應為:
i = i % (2+1);
所以 25 % 3 = 1 
*///答案: 1 

27) int i=50, j; j=(i++)+(++i)+(--i)+(i*2); 請問System.out.print(j)的值為何? /*
j = 50 + 52 + 51 + 102 = 255 
*///答案: 255

34) int i=5, j=5; boolean result=(i++>5)&&(++i>4); result=(j++>5)||(++j>4); System.out.print(i+j); /*
short-circuiting ( &&、|| )
第一部分 &&
  (i++>5), 5>5 所以False且括號結束後i=6；
  由於&&左邊確定為False(參考真值表)，所以(++i>4)不執行, i=6;
第二部分 ||
  (j++>5), 5>5 所以False且括號結束後j=6;
  (++j>4), 7>4 所以True且最後j=7;
因此 i+j=13;
*///答案: 13
