// (08) int i=20, j; j=((i++)+(10*5)) >>(2%6); j的值是多少?
        ((i++)+(10*5)) = 20 + 50 = 70; 2%6 = 2;
        70 >> 2 代表向右移2的二次方 70/4 = 17 (int去掉後面小數點) //答案: 17
// (11)
// (12)
// (17)
// (19) int i=4, j=8, k=2, m; m=(i<<k)+k; 請問m值為何? (原題目是 m=(i<>k)，有做修正)
        4<<2 代表4向左移，4*(2^2)=16;
        16+2=18 //答案: 18
// (20) int i=25; 請問 i%=2+1;的值為何?
        由於 + 的優先權高於 %= (複合賦值運算子QAQ)，因此實際上應為:
        i = i % (2+1);
        所以 25 % 3 = 1 //答案: 1
//(27) int i=50, j; j=(i++)+(++i)+(--i)+(i*2); 請問System.out.print(j)的值為何?
       
