forest = imread('rainforest.jpg'); 
names = {'H1','u','a','n1','g1','C','h2','i1','e','n2','N4','i2','n3','g2','luv'};
S = cell(1,15); %存二值化字母圖片

for i=1:15
    alpha = imread([names{i}, '.bmp']);
    alpha = rgb2gray(alpha);
    alpha = imresize(alpha, [80, 80]);
    S{i}=uint8(~imbinarize(alpha));
end


% r通道 11100000
% 寫不出好迴圈而作業期限快到的me: 開始土法煉鋼
r8 = zeros(599,999,'uint8');
r8(10:89, 10:89)=S{1};
r8(90:169, 10:89)=S{2};
r8(10:89, 90:169)=S{3};
r8(90:169, 90:169)=S{4};
r16 = zeros(599,999,'uint8');
r16(10:89, 170:249)=S{5};

% g通道 11110000
g8 = zeros(599,999,'uint8');
g8(10:89, 999-89:999-10)=S{8};
g8(90:169, 999-89:999-10)=S{11};
g8(10:89, 999-169:999-90)=S{14};

g8(90:169, 999-169:999-90)=S{10};

% b通道 11000000
b8 = zeros(599,999,'uint8');
b8(599-89:599-10, 10:89)=S{7};
b8(599-169:599-90, 10:89)=S{9};
b8(599-89:599-10, 90:169)=S{6};
b8(599-169:599-90, 90:169)=S{12};
b16 = zeros(599,999,'uint8');
b16(599-89:599-10, 170:249)=S{13};
b32 = zeros(599,999,'uint8');
b32(599-89:599-10, 999-89:999-10)=S{15};


R = forest(:,:,1);
G = forest(:,:,2);
B = forest(:,:,3);

R = bitand(R, uint8(224))+ r16*16 + r8*8;
G = bitand(G, uint8(240))+ g8*8;
B = bitand(B, uint8(192))+ b32*32 + b16*16 + b8*8;

test = cat(3,R,G,B);
figure(1),imshow(test)
