沈老惡補英文出來的文章 : https://pubmed.ncbi.nlm.nih.gov/17681678/

img = imread('orig.bmp');
idx = find(img>0);

[y,x] = ind2sub(size(img), idx);

%獲得重心(亦為質心，因為該圖密度均勻，所以重心跟質心是同一個)
sum(y)/31772
sum(x)/31772

r = sqrt(31772/pi); //半徑

p2 = zeros(size(img));
for i=1:360
  for j=1:360
    d = sqrt( (i-181.3142)*(i-181.3142) + (j-179.1087)*(j-179.1087) ); %距離
    if(d<=r)
      p2(i, j)=1;
    end
  end
end
=======================================
*改成橢圓形(上一段是用圓形)
1. 找出面積相同的橢圓形

2. 找出圖形內最大的橢圓

3. 圖的輪廓線

4. 原圖、輪廓線、撥出去的中心點一樣嗎
